def designer_Iphone(a):
    temporary_text = ('Телефон: ' + a[1] + "\n"
                      + "------------------------------------------------------" + "\n"
                      + 'Дисплей оригинал:  ' + str(a[2]) + "\n"
                      + 'Дисплей аналог:  ' + str(a[3]) + "\n"
                      + 'Динамик слуховой:  ' + str(a[4]) + "\n"
                      + 'Динамик музыкальный:  ' + str(a[5]) + "\n"
                      + 'Нижний шлейф:  ' + str(a[6]) + "\n"
                      + 'Аккамулятор :  ' + str(a[7]) + "\n"
                      + 'Основная камера:  ' + str(a[8]) + "\n"
                      + 'Фронтальная камера:  ' + str(a[9]) + "\n"
                      + 'Шлейф кнопки включения:  ' + str(a[12]) + "\n"
                      + 'Кнопка "home":  ' + str(a[13]) + "\n"
                      + 'Задняя крышка:  ' + str(a[11]) + "\n"
                      + 'Замена стекла дисплея:  ' + str(a[10]) + "\n"
                      + 'Замена тачскрина:  ' + str(a[14]) + "\n"
                      + 'Замена стекла камеры:  ' + str(a[15]) + "\n"
                      + "------------------------------------------------------" + "\n")

    return temporary_text

def designer_phone(a):
    temporary_text = ('Телефон: ' + a[1] + "\n"
                    + "------------------------------------------------------" + "\n"
                    + 'Дисплей оригинал:  ' + str(a[2]) + "\n"
                    + 'Динамик слуховой:  ' + str(a[4]) + "\n"
                    + 'Динамик музыкальный:  ' + str(a[5]) + "\n"
                    + 'Аккамулятор :  ' + str(a[7]) + "\n"
                    + 'Основная камера:  ' + str(a[8]) + "\n"
                    + 'Фронтальная камера:  ' + str(a[9]) + "\n"
                    + 'Задняя крышка:  ' + str(a[11]) + "\n"
                    + 'Замена стекла дисплея:  ' + str(a[10]) + "\n"
                    + 'Замена тачскрина:  ' + str(a[14]) + "\n"
                    + 'Кнопка включения:  ' + str(a[16]) + "\n"
                    + 'Замена корпуса:  ' + str(a[17]) + "\n"
                    + 'Замена основной платы:  ' + str(a[18]) + "\n"
                    + 'Замена нижней платы:  ' + str(a[19]) + "\n"
                    + 'Замена межплатного шлейфа:  ' + str(a[20]) + "\n"
                    + 'Замена разъма зарядки:  ' + str(a[21]) + "\n"
                    + 'Микрофон:  ' + str(a[22]) + "\n"
                    + "------------------------------------------------------" + "\n")
    return temporary_text